; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v6 ?v4)
		(pred_2 ?v1)
		(pred_6 ?v5)
		(pred_1 ?v5)
		(pred_3 ?v1 ?v5)
		(pred_5)
		(pred_4 ?v1))

   (:action op_3
       :parameters  (?v2 ?v8)
       :precondition (and (not-eq ?v2 ?v8) 
                          (pred_6 ?v2) (pred_6 ?v8) (pred_1 ?v2))
       :effect (and  (pred_1 ?v8)
		     (not (pred_1 ?v2))))


   (:action op_1
       :parameters (?v3 ?v7)
       :precondition  (and  (pred_2 ?v3) (pred_6 ?v7)
			    (pred_3 ?v3 ?v7) (pred_1 ?v7) (pred_5))
       :effect (and (pred_4 ?v3)
		    (not (pred_3 ?v3 ?v7)) 
		    (not (pred_5))))

   (:action op_2
       :parameters  (?v3  ?v7)
       :precondition  (and  (pred_2 ?v3) (pred_6 ?v7)
			    (pred_4 ?v3) (pred_1 ?v7))
       :effect (and (pred_3 ?v3 ?v7)
		    (pred_5)
		    (not (pred_4 ?v3)))))

; problem
(define (problem ferry-l3-c3)
(:domain ferry)
(:objects obj_04 obj_06 obj_03 
          obj_02 obj_05 obj_01 
)
(:init
(pred_6 obj_04)
(pred_6 obj_06)
(pred_6 obj_03)
(pred_2 obj_02)
(pred_2 obj_05)
(pred_2 obj_01)
(not-eq obj_04 obj_06)
(not-eq obj_06 obj_04)
(not-eq obj_04 obj_03)
(not-eq obj_03 obj_04)
(not-eq obj_06 obj_03)
(not-eq obj_03 obj_06)
(pred_5)
(pred_3 obj_02 obj_04)
(pred_3 obj_05 obj_04)
(pred_3 obj_01 obj_03)
(pred_1 obj_06)
)
(:goal
(and
(pred_3 obj_02 obj_03)
(pred_3 obj_05 obj_06)
(pred_3 obj_01 obj_03)
)
)

(:constraints
  (and
    (sometime-before  (pred_3 obj_02 obj_03) (pred_1 obj_06))
    (sometime-before  (pred_3 obj_05 obj_06) (pred_1 obj_03))
  )
)
)

; plan
1. (op_3 obj_06 obj_04)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_04)
   goals met: 1 of 3
2. (op_1 obj_02 obj_04)
   deleted: (pred_3 obj_02 obj_04) (pred_5)
   added: (pred_4 obj_02)
   goals met: 1 of 3
3. (op_3 obj_04 obj_03)
   deleted: (pred_1 obj_04)
   added: (pred_1 obj_03)
   goals met: 1 of 3
4. (op_2 obj_02 obj_03)
   deleted: (pred_4 obj_02)
   added: (pred_3 obj_02 obj_03) (pred_5)
   goals met: 2 of 3
5. (op_3 obj_03 obj_04)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_04)
   goals met: 2 of 3
6. (op_1 obj_05 obj_04)
   deleted: (pred_3 obj_05 obj_04) (pred_5)
   added: (pred_4 obj_05)
   goals met: 2 of 3
7. (op_3 obj_04 obj_06)
   deleted: (pred_1 obj_04)
   added: (pred_1 obj_06)
   goals met: 2 of 3
8. (op_2 obj_05 obj_06)
   deleted: (pred_4 obj_05)
   added: (pred_3 obj_05 obj_06) (pred_5)
   goals met: 3 of 3
